app/Controllers/peminjaman.php

   public function index()
{
    $db = db_connect();

    $data['data_peminjaman'] = $db->table('peminjaman')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
        ->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left')
        ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left')
        ->select('peminjaman.*, anggota.nama_anggota, buku.judul, buku.cover')
        ->get()
        ->getResultArray();
---
SELECT `peminjaman`.*, `anggota`.`nama_anggota`, `buku`.`judul`, `buku`.`cover`
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`