app/Controllers/Pengembalian.php

SELECT *
FROM `pengembalian`
---
    public function index()
{
    $pengembalianModel = new \App\Models\PengembalianModel();

    $data['pengembalian'] = $pengembalianModel
        ->findAll();